---
kind: type
id: T:Autodesk.Revit.DB.Visual.PlasticvinylApplicationType
source: html/3167bb0d-dd9f-ee97-81d6-e619c3b4ae9c.htm
---
# Autodesk.Revit.DB.Visual.PlasticvinylApplicationType

The enumerated type representing the permitted values for the asset property "PlasticvinylApplication" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public enum PlasticvinylApplicationType
```